MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer4_pwm.c
        *pu16PDAR = (uint16_t)0u;
        *pu16PDBR = (uint16_t)0u;
        *pu16PFSR = (uint16_t)0u;
        pstcPOCR_f->DIVCK = (uint16_t)0u;
        pstcPOCR_f->LVLS = (uint16_t)0u;
        pstcPOCR_f->PWMMD = (uint16_t)0u;

        switch (enCh)
        {
        case Timer4PwmU:
            pstcRCSR_f->RTIDU = (uint16_t)0u;
            break;
        case Timer4PwmV:
            pstcRCSR_f->RTIDV = (uint16_t)0u;
            break;
        case Timer4PwmW:
            pstcRCSR_f->RTIDW = (uint16_t)0u;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Start PWM timer
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 **
 ** \retval Ok                          Start timer successfully
 ** \retval ErrorInvalidParameter       If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - enCh out of range
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_StartTimer(M4_TMR4_TypeDef *TMR4x,
                                  en_timer4_pwm_ch_t enCh)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO stc_tmr4_rcsr_field_t *pstcRCSR_f = NULL;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        enRet = Ok;
        /* Get pointer of current channel PWM register address */
        pstcRCSR_f = (__IO stc_tmr4_rcsr_field_t *)TMR4_RCSRx(TMR4x);

        switch (enCh)
        {
        case Timer4PwmU:
            pstcRCSR_f->RTEU = (uint16_t)1u;
            break;
        case Timer4PwmV:
            pstcRCSR_f->RTEV = (uint16_t)1u;
            break;
        case Timer4PwmW:
            pstcRCSR_f->RTEW = (uint16_t)1u;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Stop PWM timer
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 **
 ** \retval Ok                          Stop timer successfully
 ** \retval ErrorInvalidParameter       If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - enCh out of range
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_StopTimer(M4_TMR4_TypeDef *TMR4x,
                                 en_timer4_pwm_ch_t enCh)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO stc_tmr4_rcsr_field_t *pstcRCSR_f = NULL;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_PWM_CH(enCh));

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        enRet = Ok;

        /* Get pointer of current channel PWM register address */
        pstcRCSR_f = (__IO stc_tmr4_rcsr_field_t *)TMR4_RCSRx(TMR4x);
        switch (enCh)
        {
        case Timer4PwmU:
            pstcRCSR_f->RTSU = (uint16_t)1u;
            break;
        case Timer4PwmV:
            pstcRCSR_f->RTSV = (uint16_t)1u;
            break;
        case Timer4PwmW:
            pstcRCSR_f->RTSW = (uint16_t)1u;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get PWM reload-timer interrupt flag
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 **
 ** \retval Reset                       None interrupt request on PWM reload-timer
 ** \retval Set                         Detection interrupt request on PWM reload-timer
 **
 ******************************************************************************/
en_flag_status_t TIMER4_PWM_GetIrqFlag(M4_TMR4_TypeDef *TMR4x,
                                       en_timer4_pwm_ch_t enCh)
{
    uint16_t u16Flag = 0u;
    __IO stc_tmr4_rcsr_field_t *pstcRCSR_f = NULL;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_PWM_CH(enCh));
    DDL_ASSERT(IS_VALID_TIMER4(TMR4x));

    /* Get pointer of current channel PWM register address */
    pstcRCSR_f = (__IO stc_tmr4_rcsr_field_t *)TMR4_RCSRx(TMR4x);

    switch (enCh)
    {
    case Timer4PwmU:
        u16Flag = pstcRCSR_f->RTIFU;
        break;
    case Timer4PwmV:
        u16Flag = pstcRCSR_f->RTIFV;
        break;
    case Timer4PwmW:
        u16Flag = pstcRCSR_f->RTIFW;
        break;
    default:
        break;
    }

    return (en_flag_status_t)u16Flag;
}

/**
 *******************************************************************************
 ** \brief Clear PWM reload-timer interrupt flag
 **
 ** \param [in] TMR4x                   Pointer to Timer4 instance register base
 ** \arg M4_TMR41                       Timer4 unit 1 instance register base
 ** \arg M4_TMR42                       Timer4 unit 2 instance register base
 ** \arg M4_TMR43                       Timer4 unit 3 instance register base
 ** \param [in] enCh                    Channel of PWM
 ** \arg Timer4PwmOuhl                  Timer4 PWM couple channel OUH&OUL
 ** \arg Timer4PwmOvhl                  Timer4 PWM couple channel OVH&OVL
 ** \arg Timer4PwmOwhl                  Timer4 PWM couple channel OWH&OWL
 **
 ** \retval Ok                          PWM reload-timer interrupt flag is clear
 ** \retval ErrorInvalidParameter       If one of following conditions are met:
 **                                     - TMR4x is invalid
 **                                     - enCh out of range
 **
 ******************************************************************************/
en_result_t TIMER4_PWM_ClearIrqFlag(M4_TMR4_TypeDef *TMR4x,
                                    en_timer4_pwm_ch_t enCh)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO stc_tmr4_rcsr_field_t *pstcRCSR_f = NULL;

    /* Check TMR4x pointer */
    if (IS_VALID_TIMER4(TMR4x))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_PWM_CH(enCh));

